In [1]:
import pandas as pd

In [16]:
data={
     'age': [20,23,21],
    'name':['amit','arydeep','soham'],
   
    'sec':["d",'a','d']
    }

In [17]:
data

{'age': [20, 23, 21],
 'name': ['amit', 'arydeep', 'soham'],
 'sec': ['d', 'a', 'd']}

In [18]:
df=pd.DataFrame(data)

In [19]:
df

   age     name sec
0   20     amit   d
1   23  arydeep   a
2   21    soham   d

In [20]:
df.to_csv('iamit.csv')

In [ ]:
import numpy as np

In [8]:
anup=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [9]:
anup

            0         1         2         3         4
0    0.642479  0.877437  0.926095  0.434052  0.784007
1    0.289321  0.630498  0.732573  0.452726  0.601318
2    0.805369  0.373361  0.333876  0.893351  0.420719
3    0.695085  0.930251  0.371233  0.801035  0.996133
4    0.189629  0.752647  0.102286  0.163583  0.289070
..        ...       ...       ...       ...       ...
329  0.395425  0.045310  0.095041  0.620112  0.406677
330  0.034694  0.853403  0.631597  0.249125  0.328968
331  0.246515  0.404767  0.092302  0.800350  0.135032
332  0.895881  0.599817  0.135116  0.946729  0.840135
333  0.890930  0.582185  0.353525  0.772792  0.967618

[334 rows x 5 columns]

In [10]:
amit={
    'name':['amit','arydeep','soham','anup','sayan','sondeep','santonu'],
    'age': [20,23,21,'np.null',12,13,18],
    'sec':["d",'a','d','e','','c','b']
    }

In [11]:
amit

{'name': ['amit', 'arydeep', 'soham', 'anup', 'sayan', 'sondeep', 'santonu'],
 'age': [20, 23, 21, 'np.null', 12, 13, 18],
 'sec': ['d', 'a', 'd', 'e', '', 'c', 'b']}

In [12]:
am=pd.DataFrame(amit)

In [13]:
am

      name      age sec
0     amit       20   d
1  arydeep       23   a
2    soham       21   d
3     anup  np.null   e
4    sayan       12
5  sondeep       13   c
6  santonu       18   b

In [14]:
anup.head

<bound method NDFrame.head of             0         1         2         3         4
0    0.642479  0.877437  0.926095  0.434052  0.784007
1    0.289321  0.630498  0.732573  0.452726  0.601318
2    0.805369  0.373361  0.333876  0.893351  0.420719
3    0.695085  0.930251  0.371233  0.801035  0.996133
4    0.189629  0.752647  0.102286  0.163583  0.289070
..        ...       ...       ...       ...       ...
329  0.395425  0.045310  0.095041  0.620112  0.406677
330  0.034694  0.853403  0.631597  0.249125  0.328968
331  0.246515  0.404767  0.092302  0.800350  0.135032
332  0.895881  0.599817  0.135116  0.946729  0.840135
333  0.890930  0.582185  0.353525  0.772792  0.967618

[334 rows x 5 columns]>

In [15]:
anup.tail

<bound method NDFrame.tail of             0         1         2         3         4
0    0.642479  0.877437  0.926095  0.434052  0.784007
1    0.289321  0.630498  0.732573  0.452726  0.601318
2    0.805369  0.373361  0.333876  0.893351  0.420719
3    0.695085  0.930251  0.371233  0.801035  0.996133
4    0.189629  0.752647  0.102286  0.163583  0.289070
..        ...       ...       ...       ...       ...
329  0.395425  0.045310  0.095041  0.620112  0.406677
330  0.034694  0.853403  0.631597  0.249125  0.328968
331  0.246515  0.404767  0.092302  0.800350  0.135032
332  0.895881  0.599817  0.135116  0.946729  0.840135
333  0.890930  0.582185  0.353525  0.772792  0.967618

[334 rows x 5 columns]>